app/views/magnets/view.html.erb

SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" = ? LIMIT 1  [["id", "2"]]
---
				<div class="input-group">
					<%= f.text_field "attributes[#{Dimension.find(mag.dimension_id).dime}]" , :placeholder => Dimension.find(mag.dimension_id).dime ,class: "form-control" %>

SELECT "poles".* FROM "poles" WHERE "poles"."id" = ? LIMIT 1  [["id", "1"]]
---
			<div class="form-group">
				<% @choosenMagnet.magnet_poles.where("magnet_id = "+@choosenMagnet.id.to_s).each do |pole| %>