app/controllers/magnets_controller.rb

SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "poles".* FROM "poles" WHERE "poles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "attributes".* FROM "attributes" WHERE "attributes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def view
  	@magnets = Image.find(params[:id])
  	@poles  = Pole.find(params[:id])
  	@attributes = Attribute.find(params[:id])